# Revert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintSetup..::..Revert Method
PrintSetup Class See Also
---
Revert the current print setting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Revert()
```

Visual Basic
---
```text
Public Sub Revert
```

Visual C++
---
```text
public:
void Revert()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the current print setting is In-Session. |

# See Also
PrintSetup Class
Autodesk.Revit.DB Namespace